In [2]:
#Statistical or Mathematics Function
import pandas as pd
data={
    'one'      :pd.Series([1,2,3,4]),
    'two'      :pd.Series([10,20,30,40]),
    'three'    :pd.Series([100,200,300,400]),
    'four'     :pd.Series([1000,2000,3000,4000])
}
df=pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [3]:
df.sum()

one         10
two        100
three     1000
four     10000
dtype: int64

In [4]:
df.mean()

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

In [5]:
df.median()

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

In [6]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [7]:
de=pd.DataFrame({'A':[1,2,3,5,5,5,6],'B':[10,20,40,40,40,50,60]})
print(de['A'].mode())
print(de['B'].mode())

0    5
Name: A, dtype: int64
0    40
Name: B, dtype: int64

In [8]:
#Variance
df.var()

one      1.666667e+00
two      1.666667e+02
three    1.666667e+04
four     1.666667e+06
dtype: float64

In [9]:
df.min()

one         1
two        10
three     100
four     1000
dtype: int64

In [10]:
df.max()

one         4
two        40
three     400
four     4000
dtype: int64

In [11]:
df.describe()

            one        two       three         four
count  4.000000   4.000000    4.000000     4.000000
mean   2.500000  25.000000  250.000000  2500.000000
std    1.290994  12.909944  129.099445  1290.994449
min    1.000000  10.000000  100.000000  1000.000000
25%    1.750000  17.500000  175.000000  1750.000000
50%    2.500000  25.000000  250.000000  2500.000000
75%    3.250000  32.500000  325.000000  3250.000000
max    4.000000  40.000000  400.000000  4000.000000

In [3]:
#Statistical or Mathematics Function
import pandas as pd
data={
    'one'      :pd.Series([1,2,3,4]),
    'two'      :pd.Series([10,20,30,40]),
    'three'    :pd.Series([100,200,300,400]),
    'four'     :pd.Series([1000,2000,3000,4000])
}
def add_(i,j):
    return i+j
def sub_(i,j):
    return i-j


df=pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [4]:
df.pipe(add_,30)

   one  two  three  four
0   31   40    130  1030
1   32   50    230  2030
2   33   60    330  3030
3   34   70    430  4030

In [5]:
df.pipe(sub_,30)

   one  two  three  four
0  -29  -20     70   970
1  -28  -10    170  1970
2  -27    0    270  2970
3  -26   10    370  3970

In [6]:
def mean_(col):
    return col.mean()

def square(i):
    return i**2

df.pipe(mean_)#.pipe(square)

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

In [7]:
import numpy as np
df.apply(np.mean)

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

In [8]:
df.apply(lambda x:x.max()-x.min())

one         3
two        30
three     300
four     3000
dtype: int64

In [13]:
df.applymap(lambda x : x*100)

C:\Users\DELL\AppData\Local\Temp\ipykernel_11160\795461004.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(lambda x : x*100)

   one   two  three    four
0  100  1000  10000  100000
1  200  2000  20000  200000
2  300  3000  30000  300000
3  400  4000  40000  400000

In [14]:
df.applymap(np.int64)

C:\Users\DELL\AppData\Local\Temp\ipykernel_11160\2569093769.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(np.int64)

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [26]:
df_2=df.apply(lambda row:row.mean(),axis=1)

In [27]:
df_2

0     277.75
1     555.50
2     833.25
3    1111.00
dtype: float64

In [42]:
#Statistical or Mathematics Function
import pandas as pd
data={
    'one'      :pd.Series([1,2,3,4]),
    'two'      :pd.Series([10,20,30,40]),
    'three'    :pd.Series([100,200,300,400]),
    'four'     :pd.Series([1000,2000,3000,4000])
}

df=pd.DataFrame(data)
print(df)
print('-'*30)

#Rows
print(df.reindex([3,2,1,0]))

#Columns
print(df.rename(columns=['A','B','C','D']))

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000
------------------------------
   one  two  three  four
3    4   40    400  4000
2    3   30    300  3000
1    2   20    200  2000
0    1   10    100  1000

TypeError: 'list' object is not callable